MikroElektronika/core_packages/ARM/gcc_clang/def/silabs/EFM32PG23B200F256IM40/mcu.h
/** Flash and SRAM limits for EFM32PG23B200F256IM40 */
#define FLASH_BASE                               (0x08000000UL) /**< Flash Base Address */
#define FLASH_SIZE                               (0x00040000UL) /**< Available Flash Memory */
#define FLASH_PAGE_SIZE                          (0x00002000UL) /**< Flash Memory page size */
#define SRAM_BASE                                (0x20000000UL) /**< SRAM Base Address */
#define SRAM_SIZE                                (0x00010000UL) /**< Available SRAM Memory */
#define DMA_CHAN_COUNT                           LDMA_CH_NUM    /**< Number of DMA channels */
#define EXT_IRQ_COUNT                            76             /**< Number of External (NVIC) interrupts */

/* GPIO Avalibility Info */
#define GPIO_PA_INDEX                            0U         /**< Index of port PA */
#define GPIO_PA_COUNT                            10U        /**< Number of pins on port PA */
#define GPIO_PA_MASK                             (0x03FFUL) /**< Port PA pin mask */
#define GPIO_PA_PIN0                             1U         /**< GPIO pin PA0 is present. */
#define GPIO_PA_PIN1                             1U         /**< GPIO pin PA1 is present. */
#define GPIO_PA_PIN2                             1U         /**< GPIO pin PA2 is present. */
#define GPIO_PA_PIN3                             1U         /**< GPIO pin PA3 is present. */
#define GPIO_PA_PIN4                             1U         /**< GPIO pin PA4 is present. */
#define GPIO_PA_PIN5                             1U         /**< GPIO pin PA5 is present. */
#define GPIO_PA_PIN6                             1U         /**< GPIO pin PA6 is present. */
#define GPIO_PA_PIN7                             1U         /**< GPIO pin PA7 is present. */
#define GPIO_PA_PIN8                             1U         /**< GPIO pin PA8 is present. */
#define GPIO_PA_PIN9                             1U         /**< GPIO pin PA9 is present. */
#define GPIO_PB_INDEX                            1U         /**< Index of port PB */
#define GPIO_PB_COUNT                            7U         /**< Number of pins on port PB */
#define GPIO_PB_MASK                             (0x007FUL) /**< Port PB pin mask */
#define GPIO_PB_PIN0                             1U         /**< GPIO pin PB0 is present. */
#define GPIO_PB_PIN1                             1U         /**< GPIO pin PB1 is present. */
#define GPIO_PB_PIN2                             1U         /**< GPIO pin PB2 is present. */
#define GPIO_PB_PIN3                             1U         /**< GPIO pin PB3 is present. */
#define GPIO_PB_PIN4                             1U         /**< GPIO pin PB4 is present. */
#define GPIO_PB_PIN5                             1U         /**< GPIO pin PB5 is present. */
#define GPIO_PB_PIN6                             1U         /**< GPIO pin PB6 is present. */
#define GPIO_PC_INDEX                            2U         /**< Index of port PC */
#define GPIO_PC_COUNT                            8U         /**< Number of pins on port PC */
#define GPIO_PC_MASK                             (0x00FFUL) /**< Port PC pin mask */
#define GPIO_PC_PIN0                             1U         /**< GPIO pin PC0 is present. */
#define GPIO_PC_PIN1                             1U         /**< GPIO pin PC1 is present. */
#define GPIO_PC_PIN2                             1U         /**< GPIO pin PC2 is present. */
#define GPIO_PC_PIN3                             1U         /**< GPIO pin PC3 is present. */
#define GPIO_PC_PIN4                             1U         /**< GPIO pin PC4 is present. */
#define GPIO_PC_PIN5                             1U         /**< GPIO pin PC5 is present. */
#define GPIO_PC_PIN6                             1U         /**< GPIO pin PC6 is present. */
#define GPIO_PC_PIN7                             1U         /**< GPIO pin PC7 is present. */
#define GPIO_PD_INDEX                            3U         /**< Index of port PD */
#define GPIO_PD_COUNT                            4U         /**< Number of pins on port PD */
#define GPIO_PD_MASK                             (0x000FUL) /**< Port PD pin mask */
#define GPIO_PD_PIN0                             1U         /**< GPIO pin PD0 is present. */
#define GPIO_PD_PIN1                             1U         /**< GPIO pin PD1 is present. */
#define GPIO_PD_PIN2                             1U         /**< GPIO pin PD2 is present. */
#define GPIO_PD_PIN3                             1U         /**< GPIO pin PD3 is present. */

/* Fixed Resource Locations */
#define GPIO_SWCLK_PORT                          GPIO_PA_INDEX /**< Port of SWCLK.*/
#define GPIO_SWCLK_PIN                           1U            /**< Pin of SWCLK.*/
#define GPIO_SWDIO_PORT                          GPIO_PA_INDEX /**< Port of SWDIO.*/
#define GPIO_SWDIO_PIN                           2U            /**< Pin of SWDIO.*/
#define GPIO_SWV_PORT                            GPIO_PA_INDEX /**< Port of SWV.*/
#define GPIO_SWV_PIN                             3U            /**< Pin of SWV.*/
#define GPIO_TDI_PORT                            GPIO_PA_INDEX /**< Port of TDI.*/
#define GPIO_TDI_PIN                             4U            /**< Pin of TDI.*/
#define GPIO_TDO_PORT                            GPIO_PA_INDEX /**< Port of TDO.*/
#define GPIO_TDO_PIN                             3U            /**< Pin of TDO.*/
#define GPIO_TRACECLK_PORT                       GPIO_PA_INDEX /**< Port of TRACECLK.*/
#define GPIO_TRACECLK_PIN                        4U            /**< Pin of TRACECLK.*/
#define GPIO_TRACEDATA0_PORT                     GPIO_PA_INDEX /**< Port of TRACEDATA0.*/
#define GPIO_TRACEDATA0_PIN                      3U            /**< Pin of TRACEDATA0.*/
#define GPIO_TRACEDATA1_PORT                     GPIO_PA_INDEX /**< Port of TRACEDATA1.*/
#define GPIO_TRACEDATA1_PIN                      5U            /**< Pin of TRACEDATA1.*/
#define GPIO_TRACEDATA2_PORT                     GPIO_PA_INDEX /**< Port of TRACEDATA2.*/
#define GPIO_TRACEDATA2_PIN                      6U            /**< Pin of TRACEDATA2.*/
#define GPIO_TRACEDATA3_PORT                     GPIO_PA_INDEX /**< Port of TRACEDATA3.*/
#define GPIO_TRACEDATA3_PIN                      7U            /**< Pin of TRACEDATA3.*/
#define GPIO_EM4WU0_PORT                         GPIO_PA_INDEX /**< Port of EM4WU0.*/
#define GPIO_EM4WU0_PIN                          5U            /**< Pin of EM4WU0.*/
#define GPIO_EM4WU3_PORT                         GPIO_PB_INDEX /**< Port of EM4WU3.*/
#define GPIO_EM4WU3_PIN                          1U            /**< Pin of EM4WU3.*/
#define GPIO_EM4WU4_PORT                         GPIO_PB_INDEX /**< Port of EM4WU4.*/
#define GPIO_EM4WU4_PIN                          3U            /**< Pin of EM4WU4.*/
#define GPIO_EM4WU6_PORT                         GPIO_PC_INDEX /**< Port of EM4WU6.*/
#define GPIO_EM4WU6_PIN                          0U            /**< Pin of EM4WU6.*/
#define GPIO_EM4WU7_PORT                         GPIO_PC_INDEX /**< Port of EM4WU7.*/
#define GPIO_EM4WU7_PIN                          5U            /**< Pin of EM4WU7.*/
#define GPIO_EM4WU8_PORT                         GPIO_PC_INDEX /**< Port of EM4WU8.*/
#define GPIO_EM4WU8_PIN                          7U            /**< Pin of EM4WU8.*/
#define GPIO_EM4WU9_PORT                         GPIO_PD_INDEX /**< Port of EM4WU9.*/
#define GPIO_EM4WU9_PIN                          2U            /**< Pin of EM4WU9.*/
#define IADC0_VREFP_PORT                         GPIO_PA_INDEX /**< Port of VREFP.*/
#define IADC0_VREFP_PIN                          0U            /**< Pin of VREFP.*/
#define LCD_COM0_PORT                            GPIO_PD_INDEX /**< Port of COM0.*/
#define LCD_COM0_PIN                             2U            /**< Pin of COM0.*/
#define LCD_COM1_PORT                            GPIO_PD_INDEX /**< Port of COM1.*/
#define LCD_COM1_PIN                             3U            /**< Pin of COM1.*/
#define LCD_LCD_CP_PORT                          GPIO_PA_INDEX /**< Port of LCD_CP.*/
#define LCD_LCD_CP_PIN                           6U            /**< Pin of LCD_CP.*/
#define LCD_SEG0_PORT                            GPIO_PC_INDEX /**< Port of SEG0.*/
#define LCD_SEG0_PIN                             0U            /**< Pin of SEG0.*/
#define LCD_SEG1_PORT                            GPIO_PC_INDEX /**< Port of SEG1.*/
#define LCD_SEG1_PIN                             1U            /**< Pin of SEG1.*/
#define LCD_SEG10_PORT                           GPIO_PA_INDEX /**< Port of SEG10.*/
#define LCD_SEG10_PIN                            4U            /**< Pin of SEG10.*/
#define LCD_SEG11_PORT                           GPIO_PA_INDEX /**< Port of SEG11.*/
#define LCD_SEG11_PIN                            5U            /**< Pin of SEG11.*/
#define LCD_SEG12_PORT                           GPIO_PA_INDEX /**< Port of SEG12.*/
#define LCD_SEG12_PIN                            7U            /**< Pin of SEG12.*/
#define LCD_SEG13_PORT                           GPIO_PA_INDEX /**< Port of SEG13.*/
#define LCD_SEG13_PIN                            8U            /**< Pin of SEG13.*/
#define LCD_SEG14_PORT                           GPIO_PB_INDEX /**< Port of SEG14.*/
#define LCD_SEG14_PIN                            0U            /**< Pin of SEG14.*/
#define LCD_SEG15_PORT                           GPIO_PB_INDEX /**< Port of SEG15.*/
#define LCD_SEG15_PIN                            1U            /**< Pin of SEG15.*/
#define LCD_SEG16_PORT                           GPIO_PB_INDEX /**< Port of SEG16.*/
#define LCD_SEG16_PIN                            2U            /**< Pin of SEG16.*/
#define LCD_SEG17_PORT                           GPIO_PB_INDEX /**< Port of SEG17.*/
#define LCD_SEG17_PIN                            3U            /**< Pin of SEG17.*/
#define LCD_SEG2_PORT                            GPIO_PC_INDEX /**< Port of SEG2.*/
#define LCD_SEG2_PIN                             2U            /**< Pin of SEG2.*/
#define LCD_SEG3_PORT                            GPIO_PC_INDEX /**< Port of SEG3.*/
#define LCD_SEG3_PIN                             3U            /**< Pin of SEG3.*/
#define LCD_SEG4_PORT                            GPIO_PC_INDEX /**< Port of SEG4.*/
#define LCD_SEG4_PIN                             4U            /**< Pin of SEG4.*/
#define LCD_SEG5_PORT                            GPIO_PC_INDEX /**< Port of SEG5.*/
#define LCD_SEG5_PIN                             5U            /**< Pin of SEG5.*/
#define LCD_SEG6_PORT                            GPIO_PC_INDEX /**< Port of SEG6.*/
#define LCD_SEG6_PIN                             6U            /**< Pin of SEG6.*/
#define LCD_SEG7_PORT                            GPIO_PC_INDEX /**< Port of SEG7.*/
#define LCD_SEG7_PIN                             7U            /**< Pin of SEG7.*/
#define LCD_SEG8_PORT                            GPIO_PA_INDEX /**< Port of SEG8.*/
#define LCD_SEG8_PIN                             0U            /**< Pin of SEG8.*/
#define LCD_SEG9_PORT                            GPIO_PA_INDEX /**< Port of SEG9.*/
#define LCD_SEG9_PIN                             1U            /**< Pin of SEG9.*/
#define LESENSE_EN_0_PORT                        GPIO_PA_INDEX /**< Port of EN_0.*/
#define LESENSE_EN_0_PIN                         3U            /**< Pin of EN_0.*/
#define LESENSE_EN_1_PORT                        GPIO_PA_INDEX /**< Port of EN_1.*/
#define LESENSE_EN_1_PIN                         4U            /**< Pin of EN_1.*/
#define LESENSE_EN_2_PORT                        GPIO_PA_INDEX /**< Port of EN_2.*/
#define LESENSE_EN_2_PIN                         5U            /**< Pin of EN_2.*/
#define LFXO_LFXTAL_I_PORT                       GPIO_PD_INDEX /**< Port of LFXTAL_I.*/
#define LFXO_LFXTAL_I_PIN                        1U            /**< Pin of LFXTAL_I.*/
#define LFXO_LFXTAL_O_PORT                       GPIO_PD_INDEX /**< Port of LFXTAL_O.*/
#define LFXO_LFXTAL_O_PIN                        0U            /**< Pin of LFXTAL_O.*/
#define LFXO_LF_EXTCLK_PORT                      GPIO_PD_INDEX /**< Port of LF_EXTCLK.*/
#define LFXO_LF_EXTCLK_PIN                       1U            /**< Pin of LF_EXTCLK.*/
#define VDAC0_CH0_MAIN_OUT_PORT                  GPIO_PB_INDEX /**< Port of CH0_MAIN_OUT.*/
#define VDAC0_CH0_MAIN_OUT_PIN                   0U            /**< Pin of CH0_MAIN_OUT.*/
#define VDAC0_CH1_MAIN_OUT_PORT                  GPIO_PB_INDEX /**< Port of CH1_MAIN_OUT.*/
#define VDAC0_CH1_MAIN_OUT_PIN                   1U            /**< Pin of CH1_MAIN_OUT.*/

/* Part number capabilities */
#define ACMP_PRESENT                               /** ACMP is available in this part */
#define ACMP_COUNT                               2 /** 2 ACMPs available  */
#define BURAM_PRESENT                              /** BURAM is available in this part */
#define BURAM_COUNT                              1 /** 1 BURAMs available  */
#define BURTC_PRESENT                              /** BURTC is available in this part */
#define BURTC_COUNT                              1 /** 1 BURTCs available  */
#define CMU_PRESENT                                /** CMU is available in this part */
#define CMU_COUNT                                1 /** 1 CMUs available  */
#define DCDC_PRESENT                               /** DCDC is available in this part */
#define DCDC_COUNT                               1 /** 1 DCDCs available  */
#define DMEM_PRESENT                               /** DMEM is available in this part */
#define DMEM_COUNT                               1 /** 1 DMEMs available  */
#define DPLL_PRESENT                               /** DPLL is available in this part */
#define DPLL_COUNT                               1 /** 1 DPLLs available  */
#define EMU_PRESENT                                /** EMU is available in this part */
#define EMU_COUNT                                1 /** 1 EMUs available  */
#define EUSART_PRESENT                             /** EUSART is available in this part */
#define EUSART_COUNT                             3 /** 3 EUSARTs available  */
#define FSRCO_PRESENT                              /** FSRCO is available in this part */
#define FSRCO_COUNT                              1 /** 1 FSRCOs available  */
#define GPCRC_PRESENT                              /** GPCRC is available in this part */
#define GPCRC_COUNT                              1 /** 1 GPCRCs available  */
#define GPIO_PRESENT                               /** GPIO is available in this part */
#define GPIO_COUNT                               1 /** 1 GPIOs available  */
#define HFRCO_PRESENT                              /** HFRCO is available in this part */
#define HFRCO_COUNT                              1 /** 1 HFRCOs available  */
#define HFRCOEM23_PRESENT                          /** HFRCOEM23 is available in this part */
#define HFRCOEM23_COUNT                          1 /** 1 HFRCOEM23s available  */
#define HFXO_PRESENT                               /** HFXO is available in this part */
#define HFXO_COUNT                               1 /** 1 HFXOs available  */
#define HOSTMAILBOX_PRESENT                        /** HOSTMAILBOX is available in this part */
#define HOSTMAILBOX_COUNT                        1 /** 1 HOSTMAILBOXs available  */
#define I2C_PRESENT                                /** I2C is available in this part */
#define I2C_COUNT                                2 /** 2 I2Cs available  */
#define IADC_PRESENT                               /** IADC is available in this part */
#define IADC_COUNT                               1 /** 1 IADCs available  */
#define ICACHE_PRESENT                             /** ICACHE is available in this part */
#define ICACHE_COUNT                             1 /** 1 ICACHEs available  */
#define KEYSCAN_PRESENT                            /** KEYSCAN is available in this part */
#define KEYSCAN_COUNT                            1 /** 1 KEYSCANs available  */
#define LCD_PRESENT                                /** LCD is available in this part */
#define LCD_COUNT                                1 /** 1 LCDs available  */
#define LCDRF_PRESENT                              /** LCDRF is available in this part */
#define LCDRF_COUNT                              1 /** 1 LCDRFs available  */
#define LDMA_PRESENT                               /** LDMA is available in this part */
#define LDMA_COUNT                               1 /** 1 LDMAs available  */
#define LDMAXBAR_PRESENT                           /** LDMAXBAR is available in this part */
#define LDMAXBAR_COUNT                           1 /** 1 LDMAXBARs available  */
#define LESENSE_PRESENT                            /** LESENSE is available in this part */
#define LESENSE_COUNT                            1 /** 1 LESENSEs available  */
#define LETIMER_PRESENT                            /** LETIMER is available in this part */
#define LETIMER_COUNT                            1 /** 1 LETIMERs available  */
#define LFRCO_PRESENT                              /** LFRCO is available in this part */
#define LFRCO_COUNT                              1 /** 1 LFRCOs available  */
#define LFXO_PRESENT                               /** LFXO is available in this part */
#define LFXO_COUNT                               1 /** 1 LFXOs available  */
#define MSC_PRESENT                                /** MSC is available in this part */
#define MSC_COUNT                                1 /** 1 MSCs available  */
#define PCNT_PRESENT                               /** PCNT is available in this part */
#define PCNT_COUNT                               1 /** 1 PCNTs available  */
#define PRS_PRESENT                                /** PRS is available in this part */
#define PRS_COUNT                                1 /** 1 PRSs available  */
#define SCRATCHPAD_PRESENT                         /** SCRATCHPAD is available in this part */
#define SCRATCHPAD_COUNT                         1 /** 1 SCRATCHPADs available  */
#define SEMAILBOX_PRESENT                          /** SEMAILBOX is available in this part */
#define SEMAILBOX_COUNT                          1 /** 1 SEMAILBOXs available  */
#define SMU_PRESENT                                /** SMU is available in this part */
#define SMU_COUNT                                1 /** 1 SMUs available  */
#define SYSCFG_PRESENT                             /** SYSCFG is available in this part */
#define SYSCFG_COUNT                             1 /** 1 SYSCFGs available  */
#define SYSRTC_PRESENT                             /** SYSRTC is available in this part */
#define SYSRTC_COUNT                             1 /** 1 SYSRTCs available  */
#define TIMER_PRESENT                              /** TIMER is available in this part */
#define TIMER_COUNT                              5 /** 5 TIMERs available  */
#define ULFRCO_PRESENT                             /** ULFRCO is available in this part */
#define ULFRCO_COUNT                             1 /** 1 ULFRCOs available  */
#define USART_PRESENT                              /** USART is available in this part */
#define USART_COUNT                              1 /** 1 USARTs available  */
#define VDAC_PRESENT                               /** VDAC is available in this part */
#define VDAC_COUNT                               1 /** 1 VDACs available  */
#define WDOG_PRESENT                               /** WDOG is available in this part */
#define WDOG_COUNT                               2 /** 2 WDOGs available  */
#define DEVINFO_PRESENT                            /** DEVINFO is available in this part */
#define DEVINFO_COUNT                            1 /** 1 DEVINFOs available  */

/* Include standard ARM headers for the core */
// #include "core_cm33.h"        /* Core Header File */  // Note: Changed for MikroE implementation.
// #include "system_efm32pg23.h" /* System Header File */  // Note: Changed for MikroE implementation.
#include <stdint.h>
#define     __I     volatile const       /*!< Defines 'read only' permissions */
#define     __O     volatile             /*!< Defines 'write only' permissions */
#define     __IO    volatile             /*!< Defines 'read / write' permissions */

/* following defines should be used for structure members */
#define     __IM     volatile const      /*! Defines 'read only' structure member permissions */
#define     __OM     volatile            /*! Defines 'write only' structure member permissions */
#define     __IOM    volatile            /*! Defines 'read / write' structure member permissions */

